# -*- coding: utf-8 -*-
segwords = ['發文日期','發文字號','主旨','依據','公告事項','發布日期','更新日期','發布單位']

#            0     1      2     3      4      5     6      7
qtypes = ['分割','代位','拍賣','指界','詢價','繼承','鑑價','囑託']

#             splits-分詞關鍵字
#------------------------------------------
#         qtypes   title   subject   anncm
# 分割     0-0      0-1      0-2      0-3
# 代位     1-0      1-1      1-2      1-3
# 拍賣     2-0      2-1      2-2      2-3
# 指界     3-0      3-1      3-2      3-3
# 詢價     4-0      4-1      4-2      4-3
# 繼承     5-0      5-1      5-2      5-3
# 鑑價     6-0      6-1      6-2      6-3
# 囑託     7-0      7-1      7-2      7-3

# 說明：定義擷句的起始規則，每個解析單位(title, subject, anncm),皆有所屬之「起始句陣列」與「終結句陣列」，分別對應的陣列順序為[0]與[1]
splits = [
    ['分割',[['號'],['之']],[['應送達與','送達人','送達與','被告','被告人','債務人','繼承人','出租人','共有人','告知人','受告知人','受取權人','所有權人','上訴人','相對人','被代位人','原告','訴訟人','公示送達','公告徵詢'],
                         ['在租金','或其繼承人','所有如','表示優先','之中華民國','之台灣金融','之言詞辯論','之110','之111','之不動產','之第二次','之分配','之本院','之正本','之民事','之扣押','之判決','之函文','之命補','之定期','之拍賣','之指界','之查封','之計算','之限定','之家事','之起訴','之執行','之通知','之陳述','之裁定','之訴狀','之開庭','之補正','之詢價','之撤回','之確認','之優先','之應買','之檢送','之鑑價','之囑託','之第','判決正本','言詞辯論','拍賣','查封','限期','配期','就提存','間清償','間給付','對受領','優先','之']],[[],[]]],
    ['代位',[['號'],['之']],[['應送達與','送達人','送達與','被告','被告人','債務人','繼承人','出租人','共有人','告知人','受告知人','受取權人','所有權人','上訴人','相對人','被代位人','原告','訴訟人','公示送達','公告徵詢'],
                         ['在租金','或其繼承人','所有如','表示優先','之中華民國','之台灣金融','之言詞辯論','之110','之111','之不動產','之第二次','之分配','之本院','之正本','之民事','之扣押','之判決','之函文','之命補','之定期','之拍賣','之指界','之查封','之計算','之限定','之家事','之起訴','之執行','之通知','之陳述','之裁定','之訴狀','之開庭','之補正','之詢價','之撤回','之確認','之優先','之應買','之檢送','之鑑價','之囑託','之第','判決正本','言詞辯論','拍賣','查封','限期','配期','就提存','間清償','間給付','對受領','優先','之']],[
                             ['債務人','被告','應送達','送達','代理人','相對人','被上訴人','當事人欄「','聲請人','等','號','原告'],
                             ['間分割','間拍賣','間返還','間清償','間給付','間債務','間損害','間變價','間清償','間給付','間債務','間分割','間求償','間拍賣','間返還','間侵權','間票款','間變價','間塗銷','間請求','間變賣','間土地','間（給付','得隨時','等之代位','等間代位','等間給付','等人間','等三人','等四人','等五人','等人','上列當事人','之裁定正本','之言詞辯論','之開庭','之民事','之給付','之確認','間（清償債務）','」之記載','間']]],
    ['拍賣',[['號'],['之']],[['應送達與','送達人','送達與','被告','被告人','債務人','繼承人','出租人','共有人','告知人','受告知人','受取權人','所有權人','上訴人','相對人','被代位人','原告','訴訟人','公示送達','公告徵詢'],
                         ['在租金','或其繼承人','所有如','表示優先','之中華民國','之台灣金融','之言詞辯論','之110','之111','之不動產','之第二次','之分配','之本院','之正本','之民事','之扣押','之判決','之函文','之命補','之定期','之拍賣','之指界','之查封','之計算','之限定','之家事','之起訴','之執行','之通知','之陳述','之裁定','之訴狀','之開庭','之補正','之詢價','之撤回','之確認','之優先','之應買','之檢送','之鑑價','之囑託','之第','判決正本','言詞辯論','拍賣','查封','限期','配期','就提存','間清償','間給付','對受領','優先','之']],[
                             ['債務人','被告','應送達','送達','代理人','相對人','被上訴人','當事人欄「','聲請人','等','號','原告'],
                             ['間分割','間拍賣','間返還','間清償','間給付','間債務','間損害','間變價','間清償','間給付','間債務','間分割','間求償','間拍賣','間返還','間侵權','間票款','間變價','間塗銷','間請求','間變賣','間土地','間（給付','得隨時','等之代位','等間代位','等間給付','等人間','等三人','等四人','等五人','等人','上列當事人','之裁定正本','之言詞辯論','之開庭','之民事','之給付','之確認','間（清償債務）','」之記載','間']]],
    ['指界',[['號'],['之']],[['應送達與','送達人','送達與','被告','被告人','債務人','繼承人','出租人','共有人','告知人','受告知人','受取權人','所有權人','上訴人','相對人','被代位人','原告','訴訟人','公示送達','公告徵詢'],
                         ['在租金','或其繼承人','所有如','表示優先','之中華民國','之台灣金融','之言詞辯論','之110','之111','之不動產','之第二次','之分配','之本院','之正本','之民事','之扣押','之判決','之函文','之命補','之定期','之拍賣','之指界','之查封','之計算','之限定','之家事','之起訴','之執行','之通知','之陳述','之裁定','之訴狀','之開庭','之補正','之詢價','之撤回','之確認','之優先','之應買','之檢送','之鑑價','之囑託','之第','判決正本','言詞辯論','拍賣','查封','限期','配期','就提存','間清償','間給付','對受領','優先','之']],[
                             ['債務人','被告','應送達','送達','代理人','相對人','被上訴人','當事人欄「','聲請人','等','號','原告'],
                             ['間分割','間拍賣','間返還','間清償','間給付','間債務','間損害','間變價','間清償','間給付','間債務','間分割','間求償','間拍賣','間返還','間侵權','間票款','間變價','間塗銷','間請求','間變賣','間土地','間（給付','得隨時','等之代位','等間代位','等間給付','等人間','等三人','等四人','等五人','等人','上列當事人','之裁定正本','之言詞辯論','之開庭','之民事','之給付','之確認','間（清償債務）','」之記載','間']]],
    ['詢價',[['號'],['之']],[['應送達與','送達人','送達與','被告','被告人','債務人','繼承人','出租人','共有人','告知人','受告知人','受取權人','所有權人','上訴人','相對人','被代位人','原告','訴訟人','公示送達','公告徵詢'],
                         ['在租金','或其繼承人','所有如','表示優先','之中華民國','之台灣金融','之言詞辯論','之110','之111','之不動產','之第二次','之分配','之本院','之正本','之民事','之扣押','之判決','之函文','之命補','之定期','之拍賣','之指界','之查封','之計算','之限定','之家事','之起訴','之執行','之通知','之陳述','之裁定','之訴狀','之開庭','之補正','之詢價','之撤回','之確認','之優先','之應買','之檢送','之鑑價','之囑託','之第','判決正本','言詞辯論','拍賣','查封','限期','配期','就提存','間清償','間給付','對受領','優先','之']],[
                             ['債務人','被告','應送達','送達','代理人','相對人','被上訴人','當事人欄「','聲請人','等','號','原告'],
                             ['間分割','間拍賣','間返還','間清償','間給付','間債務','間損害','間變價','間清償','間給付','間債務','間分割','間求償','間拍賣','間返還','間侵權','間票款','間變價','間塗銷','間請求','間變賣','間土地','間（給付','得隨時','等之代位','等間代位','等間給付','等人間','等三人','等四人','等五人','等人','上列當事人','之裁定正本','之言詞辯論','之開庭','之民事','之給付','之確認','間（清償債務）','」之記載','間']]],
    ['繼承',[['號'],['之']],[['應送達與','送達人','送達與','被告','被告人','債務人','繼承人','出租人','共有人','告知人','受告知人','受取權人','所有權人','上訴人','相對人','被代位人','原告','訴訟人','公示送達','公告徵詢'],
                         ['在租金','或其繼承人','所有如','表示優先','之中華民國','之台灣金融','之言詞辯論','之110','之111','之不動產','之第二次','之分配','之本院','之正本','之民事','之扣押','之判決','之函文','之命補','之定期','之拍賣','之指界','之查封','之計算','之限定','之家事','之起訴','之執行','之通知','之陳述','之裁定','之訴狀','之開庭','之補正','之詢價','之撤回','之確認','之優先','之應買','之檢送','之鑑價','之囑託','之第','判決正本','言詞辯論','拍賣','查封','限期','配期','就提存','間清償','間給付','對受領','優先','之']],[
                             ['債務人','被告','應送達','送達','代理人','相對人','被上訴人','當事人欄「','聲請人','等','號','原告'],
                             ['間分割','間拍賣','間返還','間清償','間給付','間債務','間損害','間變價','間清償','間給付','間債務','間分割','間求償','間拍賣','間返還','間侵權','間票款','間變價','間塗銷','間請求','間變賣','間土地','間（給付','得隨時','等之代位','等間代位','等間給付','等人間','等三人','等四人','等五人','等人','上列當事人','之裁定正本','之言詞辯論','之開庭','之民事','之給付','之確認','間（清償債務）','」之記載','間']]],
    ['鑑價',[['號'],['之']],[['應送達與','送達人','送達與','被告','被告人','債務人','繼承人','出租人','共有人','告知人','受告知人','受取權人','所有權人','上訴人','相對人','被代位人','原告','訴訟人','公示送達','公告徵詢'],
                         ['在租金','或其繼承人','所有如','表示優先','之中華民國','之台灣金融','之言詞辯論','之110','之111','之不動產','之第二次','之分配','之本院','之正本','之民事','之扣押','之判決','之函文','之命補','之定期','之拍賣','之指界','之查封','之計算','之限定','之家事','之起訴','之執行','之通知','之陳述','之裁定','之訴狀','之開庭','之補正','之詢價','之撤回','之確認','之優先','之應買','之檢送','之鑑價','之囑託','之第','判決正本','言詞辯論','拍賣','查封','限期','配期','就提存','間清償','間給付','對受領','優先','之']],[
                             ['債務人','被告','應送達','送達','代理人','相對人','被上訴人','當事人欄「','聲請人','等','號','原告'],
                             ['間分割','間拍賣','間返還','間清償','間給付','間債務','間損害','間變價','間清償','間給付','間債務','間分割','間求償','間拍賣','間返還','間侵權','間票款','間變價','間塗銷','間請求','間變賣','間土地','間（給付','得隨時','等之代位','等間代位','等間給付','等人間','等三人','等四人','等五人','等人','上列當事人','之裁定正本','之言詞辯論','之開庭','之民事','之給付','之確認','間（清償債務）','」之記載','間']]],
    ['囑託',[['號'],['之']],[['應送達與','送達人','送達與','被告','被告人','債務人','繼承人','出租人','共有人','告知人','受告知人','受取權人','所有權人','上訴人','相對人','被代位人','原告','訴訟人','公示送達','公告徵詢'],
                         ['在租金','或其繼承人','所有如','表示優先','之中華民國','之台灣金融','之言詞辯論','之110','之111','之不動產','之第二次','之分配','之本院','之正本','之民事','之扣押','之判決','之函文','之命補','之定期','之拍賣','之指界','之查封','之計算','之限定','之家事','之起訴','之執行','之通知','之陳述','之裁定','之訴狀','之開庭','之補正','之詢價','之撤回','之確認','之優先','之應買','之檢送','之鑑價','之囑託','之第','判決正本','言詞辯論','拍賣','查封','限期','配期','就提存','間清償','間給付','對受領','優先','之']],[
                             ['債務人','被告','應送達','送達','代理人','相對人','被上訴人','當事人欄「','聲請人','等','號','原告'],
                             ['間分割','間拍賣','間返還','間清償','間給付','間債務','間損害','間變價','間清償','間給付','間債務','間分割','間求償','間拍賣','間返還','間侵權','間票款','間變價','間塗銷','間請求','間變賣','間土地','間（給付','得隨時','等之代位','等間代位','等間給付','等人間','等三人','等四人','等五人','等人','上列當事人','之裁定正本','之言詞辯論','之開庭','之民事','之給付','之確認','間（清償債務）','」之記載','間']]],
    ]

# delimis：定義擷句後內容之非姓名相關之詞彙(hardcode)
delimis = [
    
    # 區域相關詞彙
    '住臺北市','居臺北市','臺北市','臺北','住新北市','居新北市','新北市','新北','住基隆市','居基隆市','基隆市','基隆','住桃園市','居桃園市','桃園市','桃園區','桃園',
    '住新竹縣','居新竹縣','新竹縣','住新竹市','居新竹市','新竹市','新竹','住苗栗縣','居苗栗縣','苗栗縣','苗栗市','苗栗','住臺中市','居臺中市','臺中市','臺中',
    '住南投縣','居南投縣','南投縣','南投市','南投','住彰化縣','居彰化縣','彰化縣','彰化市','彰化','住雲林縣','居雲林縣','雲林縣','雲林','住嘉義縣','居嘉義縣',
    '嘉義縣','住嘉義市','居嘉義市','嘉義市','嘉義','住臺南市','居臺南市','臺南市','臺南','住高雄市','居高雄市','高雄市','高雄','住屏東縣','居屏東縣','屏東縣',
    '屏東市','屏東','住宜蘭縣','居宜蘭縣','宜蘭縣','宜蘭市','宜蘭','住花蓮縣','居花蓮縣','花蓮縣','花蓮市','花蓮','住臺東縣','居臺東縣','臺東縣','臺東市','臺東',
    '住澎湖縣','居澎湖縣','澎湖縣','澎湖','住金門縣','居金門縣','金門縣','金門','住連江縣','居連江縣','連江縣','連江'
    '臺灣','住同上','住居同上','住居','現住','中華民國','忠孝東路段','民生東路段','民生路段','裕民六路','民生東路','忠孝東路','舊宗路'
    '中正區','大同區','中山區','萬華區','信義區','松山區','大安區','南港區','北投區','內湖區','士林區','文山區',
    '板橋區','新莊區','泰山區','林口區','淡水區','金山區','八里區','萬里區','石門區','三芝區','瑞芳區','汐止區','平溪區','貢寮區','雙溪區','深坑區','石碇區','新店區','坪林區','烏來區','中和區','永和區','土城區','三峽區','樹林區','鶯歌區','三重區','蘆洲區','五股區',
    '仁愛區','中正區','信義區','中山區','安樂區','暖暖區','七堵區',
    '中壢區','平鎮區','八德區','楊梅區','蘆竹區','龜山區','龍潭區','大溪區','大園區','觀音區','新屋區','復興區',
    '竹北市','竹東鎮','新埔鎮','關西鎮','峨眉鄉','寶山鄉','北埔鄉','橫山鄉','芎林鄉','湖口鄉','新豐鄉','尖石鄉','五峰鄉',
    '東區','北區','香山區',
    '通霄鎮','苑裡鎮','竹南鎮','頭份鎮','後龍鎮','卓蘭鎮','西湖鄉','頭屋鄉','公館鄉','銅鑼鄉','三義鄉','造橋鄉','三灣鄉','南庄鄉','大湖鄉','獅潭鄉','泰安鄉',
    '中區','東區','南區','西區','北區','北屯區','西屯區','南屯區','太平區','大里區','霧峰區','烏日區','豐原區','后里區','東勢區','石岡區','新社區','和平區','神岡區','潭子區','大雅區','大肚區','龍井區','沙鹿區','梧棲區','清水區','大甲區','外埔區','大安區',
    '埔里鎮','草屯鎮','竹山鎮','集集鎮','名間鄉','鹿谷鄉','中寮鄉','魚池鄉','國姓鄉','水里鄉','信義鄉','仁愛鄉',
    '員林鎮','和美鎮','鹿港鎮','溪湖鎮','二林鎮','田中鎮','北斗鎮','花壇鄉','芬園鄉','大村鄉','永靖鄉','伸港鄉','線西鄉','福興鄉','秀水鄉','埔心鄉','埔鹽鄉','大城鄉','芳苑鄉','竹塘鄉','社頭鄉','二水鄉','田尾鄉','埤頭鄉','溪州鄉',
    '斗六市','斗南鎮','虎尾鎮','西螺鎮','土庫鎮','北港鎮','莿桐鄉','林內鄉','古坑鄉','大埤鄉','崙背鄉','二崙鄉','麥寮鄉','臺西鄉','東勢鄉','褒忠鄉','四湖鄉','口湖鄉','水林鄉','元長鄉',
    '太保市','朴子市','布袋鎮','大林鎮','民雄鄉','溪口鄉','新港鄉','六腳鄉','東石鄉','義竹鄉','鹿草鄉','水上鄉','中埔鄉','竹崎鄉','梅山鄉','番路鄉','大埔鄉','阿里山鄉',
    '東區','西區',
    '中西區','東區','南區','北區','安平區','安南區','永康區','歸仁區','新化區','左鎮區','玉井區','楠西區','南化區','仁德區','關廟區','龍崎區','官田區','麻豆區','佳里區','西港區','七股區','將軍區','學甲區','北門區','新營區','後壁區','白河區','東山區','六甲區','下營區','柳營區','鹽水區','善化區','大內區','山上區','新市區','安定區',
    '楠梓區','左營區','鼓山區','三民區','鹽埕區','前金區','新興區','苓雅區','前鎮區','小港區','旗津區','鳳山區','大寮區','鳥松區','林園區','仁武區','大樹區','大社區','岡山區','路竹區','橋頭區','梓官區','彌陀區','永安區','燕巢區','田寮區','阿蓮區','茄萣區','湖內區','旗山區','美濃區','內門區','杉林區','甲仙區','六龜區','茂林區','桃源區','那瑪夏區',
    '潮州鎮','東港鎮','恆春鎮','萬丹鄉','長治鄉','麟洛鄉','九如鄉','里港鄉','鹽埔鄉','高樹鄉','萬巒鄉','內埔鄉','竹田鄉','新埤鄉','枋寮鄉','新園鄉','崁頂鄉','林邊鄉','南州鄉','佳冬鄉','琉球鄉','車城鄉','滿州鄉','枋山鄉','霧台鄉','瑪家鄉','泰武鄉','來義鄉','春日鄉','獅子鄉','牡丹鄉','三地門鄉',
    '羅東鎮','蘇澳鎮','頭城鎮','礁溪鄉','壯圍鄉','員山鄉','冬山鄉','五結鄉','三星鄉','大同鄉','南澳鄉',
    '鳳林鎮','玉里鎮','新城鄉','吉安鄉','壽豐鄉','秀林鄉','光復鄉','豐濱鄉','瑞穗鄉','萬榮鄉','富里鄉','卓溪鄉',
    '成功鎮','關山鎮','長濱鄉','海端鄉','池上鄉','東河鄉','鹿野鄉','延平鄉','卑南鄉','金峰鄉','大武鄉','達仁鄉','綠島鄉','蘭嶼鄉','太麻里鄉',
    '馬公市','湖西鄉','白沙鄉','西嶼鄉','望安鄉','七美鄉',
    '金城鎮','金湖鎮','金沙鎮','金寧鄉','烈嶼鄉','烏坵鄉',
    '南竿鄉','北竿鄉','莒光鄉','東引鄉',
    
    '大安','南港','北投','內湖','士林',
    '板橋','新莊','泰山','林口','淡水','金山','八里','萬里','石門','三芝','瑞芳','汐止','平溪','貢寮','雙溪','深坑','石碇','新店','坪林','烏來','土城','三峽','樹林','鶯歌','三重','蘆洲','五股',
    '仁愛','暖暖','七堵',
    '中壢','平鎮','八德','楊梅','蘆竹','龜山','龍潭','大溪','大園','觀音','新屋',
    '竹北','竹東','新埔','關西','峨眉','寶山','北埔','橫山','芎林','湖口','尖石','五峰',
    '通霄鎮','苑裡','竹南','頭份','後龍','卓蘭','西湖','頭屋','公館','銅鑼','三義','造橋','三灣','南庄','大湖','獅潭','泰安',
    '北屯','西屯','南屯','太平','大里','霧峰','烏日','豐原','后里','東勢','石岡','新社','和平','神岡','潭子','大雅','大肚','龍井','沙鹿','梧棲','清水','大甲','外埔','大安',
    '埔里','草屯','竹山','集集','名間','鹿谷','中寮','魚池','國姓','水里','信義','仁愛',
    '員林','和美','鹿港','溪湖','二林鎮','田中鎮','北斗鎮','花壇','芬園','大村','永靖','伸港','線西','福興','秀水','埔心','埔鹽','大城','芳苑','竹塘','社頭','二水','田尾','埤頭','溪州',
    '斗六','斗南','虎尾','西螺','土庫鎮','北港鎮','莿桐','林內','古坑','大埤','崙背','二崙','麥寮','臺西','東勢','褒忠','四湖','口湖','水林','元長',
    '太保','朴子','布袋','大林','民雄','溪口','新港','六腳','東石','義竹','鹿草','水上','中埔','竹崎','梅山','番路','大埔','阿里山'
    '中西','安平','安南','永康','歸仁','新化','左鎮','玉井','楠西','南化','仁德','關廟','龍崎','官田','麻豆','佳里','西港','七股','將軍','學甲','北門','新營','後壁','白河','東山','六甲','下營','柳營','鹽水','善化','大內','山上','新市','安定',
    '楠梓','左營','鼓山','三民','鹽埕','前金','新興','苓雅','前鎮','小港','旗津','鳳山','大寮','鳥松','林園','仁武','大樹','大社','岡山','路竹','橋頭','梓官','彌陀','永安','燕巢','田寮','阿蓮','茄萣','湖內','旗山','美濃','內門','杉林','甲仙','六龜','茂林','桃源','那瑪夏',
    '潮州鎮','東港鎮','恆春鎮','萬丹','長治','麟洛','九如','里港','鹽埔','高樹','萬巒','內埔','竹田','新埤','枋寮','新園','崁頂','林邊','南州','佳冬','琉球','車城','滿州','枋山','霧台','瑪家','泰武','來義','春日','獅子','牡丹','三地門',
    '羅東鎮','蘇澳鎮','頭城鎮','礁溪','壯圍','員山','冬山','五結','三星','大同','南澳',
    '鳳林鎮','玉里鎮','新城','吉安','壽豐','秀林','光復','豐濱','瑞穗','萬榮','富里','卓溪',
    '成功鎮','關山鎮','長濱','海端','池上','東河','鹿野','延平','卑南','金峰','大武','達仁','綠島','蘭嶼','太麻里',
    '馬公市','湖西','白沙','西嶼','望安','七美',
    '金城','金湖','金沙','金寧','烈嶼','烏坵',
    '南竿','北竿','莒光','東引',
           
    # 關聯法務詞彙
    '附記','所附','如附件','如附','之附件','附件',
    '第次','第號','現由','之現場','現場','現應收受','之本股','之本院','本股','本院',
    '文書現由','文書現','文書由','之文書','文書',
    '之地址','地址','之地方','地方','之地政士','地政士',
    '之身分證','身分證','統一','編號','之民事','民事','之民國','民國','之證明書','之資產','證明書','資產',
    '之法定','法定','之法庭','法庭','之法院','法院','到庭','股金及','之股金','股金','之股別','股別','得隨時','得於','隨時',
    '訴訟人','之訴訟','訴訟','訴字','之訴更','訴更','之持有人','持有人','之持有','持有','之準備書','準備書','準備','之通知函件','通知函件','通知函','之通知書','之通知','通知書','通知',
    '之變更訴','之變價','之變賣','之變更','之起訴人','之起訴','變更訴','變價','變賣','變更','起訴人','起訴',
    '被繼承人','之繼承人','繼承人','繼承',
    '之債務人','之當事人','之管理人','之管理者','之管理','之持有人','之持有者','之持有物','之持有','之保管品','之保管物','之保管人','之保管者','之保管',
    '債務人','當事人','管理人','管理者','管理','持有人','持有者','持有物','持有''保管品','保管物','保管人','保管者','保管',
    '之扣押物','之扣押人','之扣押','之假扣押物','之假扣押人','之假扣押','本書記官','書記官','之再轉繼承人','之繼承人','之轉繼承人','之被繼承人','之代收人','之代收','之代理人','之代理','之被代位人','之代位人','之代位',
    '扣押物','扣押人','假扣押','扣押','本書記官','書記官','再轉繼承人','繼承人','轉繼承人','被繼承人','代收人','代收','代理人','代理','被代位人','代位人','代位',
    '之被上訴人','之上訴人','之共有人','之共有物','之共有','之告知人','之告知','之受取權人','之抵押物','之抵押權人','之抵押權','之抵押','之相對人','之相對','之原告','之參加人','之參加',
    '被上訴人','上訴人','共有人','共有物','共有','告知人','告知','受取權人','抵押物','抵押權人','抵押權','抵押','相對人','相對','原名','原告','參加人','參加',
    '之訴訟人','之訴訟','之聲請人','之聲請','之聲明人','之聲明','之當事人','之被告','與被告',
    '訴訟人','訴訟','聲請人','聲請','聲明人','聲明','當事人','被告','之戶籍','戶籍',
    
    # 單一法務詞彙
    '之財政部','之國有','之清償','之債務','之借款','之領取','之再開','之再轉','之買賣','之開庭','之給付','之裁判','之裁定','之終止','之處分','之備查函','之塗銷','之執行',
    '財政部','國有','清償','債務','借款','來院','領取','再開','再轉','買賣','開庭','給付','裁判','裁定','終止','處分','備查函','塗銷','執行','孰為',
    '之言詞','之存款','之協議','之命令','之函文','之事件','之狀繕本','之律師','之強制','之執行','庭期前','准予','准許','之特別','之財產','之送達','之院函','之共同','之程序','之各件',
    '言詞','存款','協議','命令','函文','事件','狀繕本','律師','強制','執行','庭期前','准予','准許','特別','財產','送達','院函','共同','程序','各件',
    '之撤銷','之領取','之價金','之履勘函','確定','確知','之編號','之調查','請勿寄送','駐外','之機構','之遺產','應予','應受','應為','之聲明','之簡易庭','之繕本','之辯論','之囑託',
    '撤銷','領取','價金','履勘函','確定','確知','編號','調查','請勿寄送','駐外','機構','遺產','應予','應受','應為','聲明','簡易庭','繕本','辯論','囑託',
    '之補正函','之補字','對旨揭','之請求','之遷出','之遷讓','之房屋','之判決','之年度','之出境','之刊登','之正本','之分署','之戶政事務所','之主旨','所示','之分割','之公示','之內容',
    '之分期付款','補正函','補字','對旨揭','請求','遷出','遷讓','房屋','判決','年度','出境','刊登','正本','分署','戶政事務所','主旨','所示','分割','公示','內容','分期付款','戶政'
    '之限定','之限期','之合約','之函各','定於','之承受','之拋棄','之拍賣','於後','則前開應','致旨揭應對','時整','同上','因與','各件無法','抗字',
    '以上均','限定','限期','國外','合約','函各','定於','承受','拋棄','拍賣',
    '之更正','之期日','新院玉民明竹調字','不明','不詳','之處所','之居所','之分署','之土地複丈成果圖影本','之履勘函',
    '更正','最後籍設','期日','等人','新院玉民明竹調字','不明','不詳','處所','居所','分署','土地複丈成果圖影本','履勘函',
    
    # 雜項
    '之(','之（','-','－','(','（',')','）','、','.','/','·','··','  ',' ','　','3時整',
    '上午','下午','時分在','年○月○日生','兼','假','即','及','件','年月日','歿','殁','等','間','節本','街','巷','弄','號','樓','字第','竹調','上列','無法','陳報','已遭','有限公司','股份',
    '已為','司拍','公告','日起','如旨揭','日新院玉民明','台新','板小','各一','不能','後之減價','遷移至','戶政','事務',
    ]

# delws：定義擷句後內容之非姓名相關之詞彙(正規化動態定義)
delws = ['第[1234567890]+人',
         '第[1234567890]+次',
         '等[1234567890]+人',
         '[1234567890]+人',
         '之[0123456789]+年[0123456789]+月[0123456789]+日',
         '[0123456789]+年[0123456789]+月[0123456789]+日',
         '[0123456789]+年',
         '[0123456789]+月',
         '[0123456789]+日',
         '第[一二三四五六七八九十]+人',
         '第[一二三四五六七八九十]+次',
         '等[一二三四五六七八九十]+人',
         '[一二三四五六七八九十]+人',
         '上[一二三四五六七八九十]+',
         '之[一二三四五六七八九十百]+年[一二三四五六七八九十]+月[一二三四五六七八九十]+日',
         '[○0123456789]+年[○0123456789]+月[○0123456789]+日生',
         '[a-zA-Z0-9。:*：，\s\r\n]',
         ]