# -*- coding: utf-8 -*-

# 句首起始文字辨識
splits = [r'第[0123456789]+號']

# 角色索引(正規化表達法)
roles = [
    r'聲[\s]*請[\s]*人',# claimant
    r'相[\s]*對[\s]*人',# opposite
    r'關[\s]*係[\s]*人',# stakeholder
    r'抗[\s]*告[\s]*人',# protester
    r'原[\s]*告',# plaintiff
    r'被[\s]*告',# defendant
    r'異[\s]*議[\s]*人',# dissenter
    ]

# 角色索引(英文)
roles_en = [
    'claimant','opposite','stakeholder','protester','plaintiff','defendant','dissenter',
    ]

# 主句清洗詞庫
deletes = [
    r'間[\s]*因',r'等[\s]*間[\s]*代[\s]*位',r'代[\s]*位[\s]*請[\s]*求[\s]*',r'等[\s]*間',r'等[\s]*人[\s]*間',r'等[\s]*人',r'因[\s]*被[\s]*告[\s]*等',r'因[\s]*監[\s]*護[\s]*宣[\s]*告',
    
    r'上[\s]*當[\s]*事[\s]*人[\s]*間',r'當[\s]*事[\s]*人[\s]*間',
    
    r'上[\s]*列[\s]*抗[\s]*告[\s]*人',r'上[\s]*列[\s]*聲[\s]*請[\s]*人',r'上[\s]*列[\s]*異[\s]*議[\s]*人',r'上[\s]*列[\s]*相[\s]*對[\s]*人',
    r'上[\s]*列',

    r'兼[\s]*上[0123456789]+[\s]*人',r'兼[\s]*[0123456789]+[\s]*人',r'上[\s]*[0123456789]+[\s]*人',r'[0123456789]+[\s]*人',
    r'兼[\s]*上[一二三四五六七八九]+[\s]*人',r'兼[\s]*[一二三四五六七八九]+[\s]*人',r'上[\s]*[一二三四五六七八九]+[\s]*人',r'[一二三四五六七八九]+[\s]*人',
    
    r'間[\s]*聲[\s]*請',r'間[\s]*代[\s]*位',r'間[\s]*請[\s]*求',r'間[\s]*分[\s]*割',r'間[\s]*分[\s]*配[\s]*表',r'間[\s]*拍[\s]*賣',r'間[\s]*返[\s]*還',r'間[\s]*侵[\s]*權',
    r'間[\s]*借[\s]*款',r'間[\s]*移[\s]*轉',r'間[\s]*債[\s]*權',r'間[\s]*塗[\s]*銷',r'間[\s]*損[\s]*害',r'間[\s]*違[\s]*反',r'間[\s]*撤[\s]*銷',r'間[\s]*履[\s]*行',
    r'間[\s]*確[\s]*認',r'間[\s]*調[\s]*解',r'間[\s]*賠[\s]*償',r'間[\s]*遷[\s]*讓',r'間[\s]*繼[\s]*承',r'間[\s]*變[\s]*更',r'間[\s]*清[\s]*償',r'間[\s]*協[\s]*議',
    r'間[\s]*和[\s]*解',r'間[\s]*停[\s]*止',r'間[\s]*執[\s]*行',r'間[\s]*得[\s]*利',
    
    r'因[\s]*代[\s]*位',r'因[\s]*請[\s]*求',r'因[\s]*分[\s]*割',r'因[\s]*分[\s]*配[\s]*表',r'因[\s]*拍[\s]*賣',r'因[\s]*返[\s]*還',r'因[\s]*侵[\s]*權',r'因[\s]*借[\s]*款',r'因[\s]*移[\s]*轉',
    r'因[\s]*債[\s]*權',r'因[\s]*塗[\s]*銷',r'因[\s]*損[\s]*害',r'因[\s]*違[\s]*反',r'因[\s]*撤[\s]*銷',r'因[\s]*履[\s]*行',r'因[\s]*確[\s]*認',r'因[\s]*調[\s]*解',r'因[\s]*賠[\s]*償',
    r'因[\s]*遷[\s]*讓',r'因[\s]*繼[\s]*承',r'因[\s]*變[\s]*更',r'因[\s]*清[\s]*償',r'因[\s]*協[\s]*議',r'因[\s]*和[\s]*解',r'因[\s]*停[\s]*止',r'因[\s]*執[\s]*行',r'因[\s]*得[\s]*利',
    r'因[\s]*消[\s]*費[\s]*者',r'債[\s]*務[\s]*清[\s]*理',
    
    r'聲[\s]*請[\s]*代[\s]*位',r'聲[\s]*請[\s]*請[\s]*求',r'聲[\s]*請[\s]*分[\s]*割',r'聲[\s]*請[\s]*分[\s]*配[\s]*表',r'聲[\s]*請[\s]*拍[\s]*賣',r'聲[\s]*請[\s]*返[\s]*還',
    r'聲[\s]*請[\s]*侵[\s]*權',r'聲[\s]*請[\s]*借[\s]*款',r'聲[\s]*請[\s]*移[\s]*轉',r'聲[\s]*請[\s]*債[\s]*權',r'聲[\s]*請[\s]*塗[\s]*銷',r'聲[\s]*請[\s]*損[\s]*害',
    r'聲[\s]*請[\s]*違[\s]*反',r'聲[\s]*請[\s]*撤[\s]*銷',r'聲[\s]*請[\s]*履[\s]*行',r'聲[\s]*請[\s]*確[\s]*認',r'聲[\s]*請[\s]*調[\s]*解',r'聲[\s]*請[\s]*賠[\s]*償',
    r'聲[\s]*請[\s]*遷[\s]*讓',r'聲[\s]*請[\s]*繼[\s]*承',r'聲[\s]*請[\s]*變[\s]*更',r'聲[\s]*請[\s]*清[\s]*償',r'聲[\s]*請[\s]*協[\s]*議',r'聲[\s]*請[\s]*和[\s]*解',
    r'聲[\s]*請[\s]*停[\s]*止',r'聲[\s]*請[\s]*執[\s]*行',r'聲[\s]*請[\s]*得[\s]*利',r'聲[\s]*請[\s]*強[\s]*制',r'聲[\s]*請[\s]*消[\s]*費[\s]*者',r'聲[\s]*請[\s]*閱[\s]*卷',
    r'聲[\s]*請[\s]*確[\s]*定',r'聲[\s]*請[\s]*閱[\s]*卷',r'聲[\s]*請[\s]*商[\s]*務[\s]*仲[\s]*裁',r'裁[\s]*定'
    
    r'請[\s]*求',r'分[\s]*割',r'分[\s]*配[\s]*表',r'拍[\s]*賣',r'返[\s]*還',r'侵[\s]*權',r'借[\s]*款',r'移[\s]*轉',r'塗[\s]*銷',r'損[\s]*害',r'違[\s]*反',r'撤[\s]*銷',
    r'不[\s]*履[\s]*行',r'履[\s]*行',r'確[\s]*認',r'調[\s]*解',r'賠[\s]*償',r'遷[\s]*讓',r'變[\s]*更',r'清[\s]*償',r'協[\s]*議',r'和[\s]*解',r'停[\s]*止',r'執[\s]*行',r'得[\s]*利',r'更[\s]*生',
    
    r'優[\s]*先',r'購[\s]*買[\s]*權',r'給[\s]*付',r'管[\s]*理[\s]*費',r'強[\s]*制',r'租[\s]*金',r'不[\s]*動[\s]*產',r'動[\s]*產',r'宣[\s]*告',r'監[\s]*護',r'擔[\s]*保[\s]*金',r'擔[\s]*保',
    r'負[\s]*責[\s]*人',r'代[\s]*償[\s]*款',r'本[\s]*票',r'犯[\s]*罪',r'共[\s]*有[\s]*物',r'土[\s]*地',r'契[\s]*約',r'組[\s]*織',r'登[\s]*記',r'辦[\s]*理',r'聲[\s]*請[\s]*調[\s]*解',
    r'地[\s]*上[\s]*物',r'行[\s]*為',r'車[\s]*輛',r'防[\s]*制',r'房[\s]*屋',r'所[\s]*有[\s]*權',r'抵[\s]*押[\s]*物',r'抵[\s]*押[\s]*權',r'抵[\s]*押',r'拆[\s]*除',r'請[\s]*求[\s]*債[\s]*務[\s]*人',
    r'債[\s]*務[\s]*人[\s]*異[\s]*議',r'異[\s]*議[\s]*之[\s]*訴',r'條[\s]*例',r'貸[\s]*款',r'通[\s]*行[\s]*權',r'消[\s]*費[\s]*者',r'支[\s]*付[\s]*命[\s]*令',r'代[\s]*墊[\s]*款',
    r'地[\s]*上[\s]*權',r'定[\s]*金',r'因[\s]*毀[\s]*棄',r'拆[\s]*屋[\s]*還[\s]*地',r'侵[\s]*害',r'信[\s]*用[\s]*卡',r'信[\s]*託',r'界[\s]*址',r'訂[\s]*金',r'核[\s]*發',
    r'消[\s]*費[\s]*借[\s]*貸[\s]*款',r'消[\s]*費[\s]*借[\s]*貸',r'消[\s]*費[\s]*款',r'除[\s]*去',r'排[\s]*除',r'票[\s]*款',r'設[\s]*定',r'款[\s]*項',r'無[\s]*效',
    
    r'第[一二三四五六七八九零]+人',r'第[0123456789]+人',r'[0123456789]+年度',r'第[[0123456789]+號',r'等[一二三四五六七八九零]+人[\s]*代[\s]*位',r'等[一二三四五六七八九零]+人',
    r'等[一二三四五六七八九零]+人',r'等[0123456789]+人',
    
    r'北[\s]*簡[\s]*字',r'本[\s]*院',r'回[\s]*復',r'損[\s]*壞',r'補[\s]*償[\s]*金',r'墊[\s]*款',r'遺[\s]*囑',r'簽[\s]*帳[\s]*卡',r'贈[\s]*與',r'變[\s]*價',r'機[\s]*車',
    r'不[\s]*存[\s]*在',r'存[\s]*在',r'等[\s]*事[\s]*件',r'事[\s]*件',r'不[\s]*當',r'之[\s]*訴',r'等[\s]*案[\s]*件',r'一、',r'之[\s]*全[\s]*體[\s]*繼[\s]*承[\s]*人',
    r'[\s]+及[\s]*',r'[\s]*及[\s]+',r'酌[\s]*定',r'報[\s]*酬',r'[\s]*與[\s]+',r'[\s]+與[\s]*',r'原[\s]*狀',r'借[\s]*名',r'借[\s]*名[\s]*關[\s]*係',r'因[\s]*與',
    r'代[\s]*位[\s]*遺[\s]*產',r'所[\s]*有[\s]*物',r'費[\s]*用[\s]*額',r'訴[\s]*訟',r'飲[\s]*料[\s]*店',r'如[\s]*附[\s]*件',r'提[\s]*存[\s]*物',r'買[\s]*賣[\s]*價[\s]*金',
    r'就[\s]*其[\s]*與',
    ]

# 姓名清洗詞庫
delimis = [
    r'[「」(（)）⒈⒉⒊⒋⒌⒍⒎⒏⒐⒑⒒⒓⒔⒕⒖⒗⒘⒙⒚⒛ ①②③④⑤⑥⑦⑧⑨⑩⑪⑫⑬⑭⑮⑯⑰⑱⑲⑳㉑㉒㉓㉔㉕㉖㉗㉘㉙㉚㉛㉜㉝㉞㉟㊱㊲㊳㊴㊵㊶㊷㊸㊹㊺㊻㊼㊽㊾㊿：:，、\s]+',
    r'[\uf552\uf54c\uf550]+',
    r'兼[\s]*上[0123456789]+[\s]*人',r'兼[\s]*[0123456789]+[\s]*人',r'上[\s]*[0123456789]+[\s]*人',r'[0123456789]+[\s]*人',
    r'兼[\s]*上[一二三四五六七八九]+[\s]*人',r'兼[\s]*[一二三四五六七八九]+[\s]*人',r'上[\s]*[一二三四五六七八九]+[\s]*人',r'[一二三四五六七八九]+[\s]*人',

    r'上[\s]*[0123456789]+',
    r'兼[\s]*[0123456789]+[\s]*',
    r'[0-9]+弄',r'[0-9]+號',r'[0-9]+樓',r'[一二三四五六七八九]+弄',r'[一二三四五六七八九]+號',r'[一二三四五六七八九]+樓',r'之[0123456789]+',r'附[0123456789]+',r'附[一二三四五六七八九零]+',
    r'如附表[一二三四五六七八九]*',
    
    r'已[\s]*死[\s]*亡',r'已[\s]*歿',r'歿',
    
    r'之[\s]*承[\s]*受[\s]*人',r'之[\s]*承[\s]*當[\s]*人',r'之[\s]*繼[\s]*承[\s]*人',r'之[\s]*被[\s]*代[\s]*位[\s]*人',r'之[\s]*代[\s]*位[\s]*人',r'之[\s]*上[\s]*訴[\s]*人',
    r'之[\s]*代[\s]*理[\s]*人',r'之[\s]*代[\s]*收[\s]*人',r'之[\s]*代[\s]*理[\s]*人',r'之[\s]*共[\s]*同[\s]*代[\s]*理[\s]*人',r'之[\s]*共[\s]*有[\s]*人',
    r'之[\s]*受[\s]*告[\s]*知[\s]*人',r'之[\s]*法[\s]*定[\s]*代[\s]*理[\s]*人',r'之[\s]*特[\s]*別[\s]*代[\s]*理[\s]*人',r'之[\s]*破[\s]*產[\s]*管[\s]*理[\s]*人',
    r'之[\s]*財[\s]*產[\s]*管[\s]*理[\s]*人',r'之[\s]*被[\s]*上[\s]*訴[\s]*人',r'之[\s]*訟[\s]*代[\s]*理[\s]*人',r'之[\s]*當[\s]*事[\s]*人',r'之[\s]*複[\s]*代[\s]*理[\s]*人',
    
    r'即[\s]*承[\s]*受[\s]*人',r'即[\s]*承[\s]*當[\s]*人',r'即[\s]*繼[\s]*承[\s]*人',r'即[\s]*被[\s]*代[\s]*位[\s]*人',r'即[\s]*代[\s]*位[\s]*人',r'即[\s]*上[\s]*訴[\s]*人',
    r'即[\s]*代[\s]*理[\s]*人',r'即[\s]*代[\s]*收[\s]*人',r'即[\s]*代[\s]*理[\s]*人',r'即[\s]*共[\s]*同[\s]*代[\s]*理[\s]*人',r'即[\s]*共[\s]*有[\s]*人',r'即[\s]*受[\s]*告[\s]*知[\s]*人',
    r'即[\s]*法[\s]*定[\s]*代[\s]*理[\s]*人',r'即[\s]*特[\s]*別[\s]*代[\s]*理[\s]*人',r'即[\s]*破[\s]*產[\s]*管[\s]*理[\s]*人',r'即[\s]*財[\s]*產[\s]*管[\s]*理[\s]*人',
    r'即[\s]*被[\s]*上[\s]*訴[\s]*人',r'即[\s]*訟[\s]*代[\s]*理[\s]*人',r'即[\s]*當[\s]*事[\s]*人',r'即[\s]*複[\s]*代[\s]*理[\s]*人',
    
    r'兼[\s]*承[\s]*受[\s]*人',r'兼[\s]*承[\s]*當[\s]*人',r'兼[\s]*繼[\s]*承[\s]*人',r'兼[\s]*被[\s]*代[\s]*位[\s]*人',r'兼[\s]*代[\s]*位[\s]*人',r'兼[\s]*上[\s]*訴[\s]*人',
    r'兼[\s]*代[\s]*理[\s]*人',r'兼[\s]*代[\s]*收[\s]*人',r'兼[\s]*代[\s]*理[\s]*人',r'兼[\s]*共[\s]*同[\s]*代[\s]*理[\s]*人',r'兼[\s]*共[\s]*有[\s]*人',r'兼[\s]*受[\s]*告[\s]*知[\s]*人',
    r'兼[\s]*法[\s]*定[\s]*代[\s]*理[\s]*人',r'兼[\s]*特[\s]*別[\s]*代[\s]*理[\s]*人',r'兼[\s]*破[\s]*產[\s]*管[\s]*理[\s]*人',r'兼[\s]*財[\s]*產[\s]*管[\s]*理[\s]*人',
    r'兼[\s]*被[\s]*上[\s]*訴[\s]*人',r'兼[\s]*訟[\s]*代[\s]*理[\s]*人',r'兼[\s]*當[\s]*事[\s]*人',r'兼[\s]*複[\s]*代[\s]*理[\s]*人',
    
    r'承[\s]*受[\s]*人',r'承[\s]*當[\s]*人',r'繼[\s]*承[\s]*人',r'被[\s]*代[\s]*位[\s]*人',r'代[\s]*位[\s]*人',r'上[\s]*訴[\s]*人',r'法[\s]*定[\s]*代[\s]*理[\s]*人',r'代[\s]*收[\s]*人',
    r'共[\s]*同[\s]*代[\s]*理[\s]*人',r'共[\s]*有[\s]*人',r'受[\s]*告[\s]*知[\s]*人',r'特[\s]*別[\s]*代[\s]*理[\s]*人',r'破[\s]*產[\s]*管[\s]*理[\s]*人',
    r'財[\s]*產[\s]*管[\s]*理[\s]*人',r'被[\s]*上[\s]*訴[\s]*人',r'訟[\s]*代[\s]*理[\s]*人',r'當[\s]*事[\s]*人',r'複[\s]*代[\s]*理[\s]*人',r'代[\s]*理[\s]*人',
    
    r'中[\s]*文',r'交[\s]*通',r'刑[\s]*事[\s]*判[\s]*決',r'服[\s]*務[\s]*費',r'姓[\s]*名',r'法[\s]*律[\s]*扶[\s]*助',r'律[\s]*師',r'即',r'反[\s]*訴',r'原[\s]*名',r'租[\s]*賃',r'追[\s]*加',
    r'送[\s]*達',r'國[\s]*外[\s]*公[\s]*示',r'現[\s]*役[\s]*軍[\s]*人',r'終[\s]*止',r'買[\s]*賣',r'債[\s]*務',r'債[\s]*權',r'會[\s]*計[\s]*師',r'與',r'確[\s]*定',r'請[\s]*求',
    r'遺[\s]*產',r'繼[\s]*承',r'扶[\s]*助',
    
    r'一[\s]*複',r'人[\s]*代',r'人[\s]*共',r'人[\s]*清',r'人[\s]*複',r'上[\s]*二',r'上[\s]*開',r'已[\s]*殁',r'不[\s]*詳',
    r'之[\s]*代',r'之[\s]*共',r'及[\s]*被',r'支[\s]*票',r'文[\s]*書',r'欠[\s]*款',r'代[\s]*收',r'代[\s]*位',r'代[\s]*位',
    r'代[\s]*理',r'台[\s]*灣',r'本[\s]*件',r'共[\s]*同',r'共[\s]*同',r'共[\s]*同',r'再[\s]*審',r'同[\s]*代',r'同[\s]*共',
    r'同[\s]*複',r'年[\s]*度',r'成[\s]*功',r'免[\s]*責',r'利[\s]*害',r'利[\s]*息',r'決[\s]*議',r'足[\s]*共',r'卷[\s]*宗',
    r'卷[\s]*證',r'周[\s]*昇',r'委[\s]*任',r'委[\s]*任',r'居[\s]*間',r'所[\s]*示',r'拋[\s]*棄',r'東[\s]*京',r'法[\s]*扶',
    r'股[\s]*票',r'股[\s]*權',r'花[\s]*旗',r'前[\s]*列',r'前[\s]*列',r'指[\s]*派',r'政[\s]*府',r'星[\s]*展',r'兼[\s]*人',
    r'兼[\s]*上',r'兼[\s]*代',r'兼[\s]*前',r'原[\s]*住',r'案[\s]*件',r'案[\s]*件',r'消[\s]*費',r'偽[\s]*造',r'清[\s]*算',
    r'理[\s]*人',r'異[\s]*議',r'處[\s]*所',r'程[\s]*序',r'程[\s]*序',r'裁[\s]*定',r'視[\s]*同',r'訴[\s]*人',
    r'訴[\s]*字',r'詐[\s]*害',r'費[\s]*用',r'雄[\s]*司',r'催[\s]*告',r'解[\s]*除',r'過[\s]*戶',r'監[\s]*中',
    r'管[\s]*理',r'臺[\s]*灣',r'輔[\s]*助',r'價[\s]*金',r'廢[\s]*止',r'複[\s]*代',r'償[\s]*還',r'應[\s]*受',
    r'檢[\s]*調',r'聲[\s]*明',r'簡[\s]*字',r'小[\s]*客[\s]*車',r'已[\s]*解[\s]*除',r'之[\s]*再[\s]*轉',r'之[\s]*其[\s]*他',
    r'及[\s]*其[\s]*餘',r'地[\s]*役[\s]*權',r'住[\s]*同[\s]*上',r'事[\s]*實[\s]*上',r'參[\s]*加[\s]*人',r'基[\s]*金[\s]*會',
    r'處[\s]*分[\s]*權',r'等[\s]*聲[\s]*請',r'間[\s]*訴[\s]*字',r'電[\s]*信[\s]*費',r'監[\s]*理[\s]*人',r'之[\s]*清[\s]*算[\s]*人',
    r'有[\s]*限[\s]*公[\s]*司',r'性[\s]*防[\s]*治[\s]*法',r'聲[\s]*請[\s]*公[\s]*示',r'聲[\s]*請[\s]*閱[\s]*覽',r'之[\s]*處[\s]*所[\s]*不[\s]*明',
    r'兼[\s]*法[\s]*定[\s]*代[\s]*理',r'東[\s]*司[\s]*調[\s]*字[\s]*袋[\s]*地',r'股[\s]*份[\s]*有[\s]*限[\s]*公[\s]*司',r'持[\s]*分[\s]*權[\s]*利'

    r'住[\s]*臺[\s]*北[\s]*市',r'住[\s]*新[\s]*北[\s]*市',r'住[\s]*桃[\s]*園[\s]*市',r'住[\s]*臺[\s]*中[\s]*市',r'住[\s]*臺[\s]*南[\s]*市',r'住[\s]*高[\s]*雄[\s]*市',r'住[\s]*新[\s]*竹[\s]*縣',r'住[\s]*苗[\s]*栗[\s]*縣',r'住[\s]*彰[\s]*化[\s]*縣',r'住[\s]*南[\s]*投[\s]*縣',r'住[\s]*雲[\s]*林[\s]*縣',r'住[\s]*嘉[\s]*義[\s]*縣',r'住[\s]*屏[\s]*東[\s]*縣',r'住[\s]*宜[\s]*蘭[\s]*縣',r'住[\s]*花[\s]*蓮[\s]*縣',r'住[\s]*臺[\s]*東[\s]*縣',r'住[\s]*澎[\s]*湖[\s]*縣',r'住[\s]*金[\s]*門[\s]*縣',r'住[\s]*連[\s]*江[\s]*縣',r'住[\s]*基[\s]*隆[\s]*市',r'住[\s]*新[\s]*竹[\s]*市',r'住[\s]*嘉[\s]*義[\s]*市',
    r'居[\s]*臺[\s]*北[\s]*市',r'居[\s]*新[\s]*北[\s]*市',r'居[\s]*桃[\s]*園[\s]*市',r'居[\s]*臺[\s]*中[\s]*市',r'居[\s]*臺[\s]*南[\s]*市',r'居[\s]*高[\s]*雄[\s]*市',r'居[\s]*新[\s]*竹[\s]*縣',r'居[\s]*苗[\s]*栗[\s]*縣',r'居[\s]*彰[\s]*化[\s]*縣',r'居[\s]*南[\s]*投[\s]*縣',r'居[\s]*雲[\s]*林[\s]*縣',r'居[\s]*嘉[\s]*義[\s]*縣',r'居[\s]*屏[\s]*東[\s]*縣',r'居[\s]*宜[\s]*蘭[\s]*縣',r'居[\s]*花[\s]*蓮[\s]*縣',r'居[\s]*臺[\s]*東[\s]*縣',r'居[\s]*澎[\s]*湖[\s]*縣',r'居[\s]*金[\s]*門[\s]*縣',r'居[\s]*連[\s]*江[\s]*縣',r'居[\s]*基[\s]*隆[\s]*市',r'居[\s]*新[\s]*竹[\s]*市',r'居[\s]*嘉[\s]*義[\s]*市',
    r'設[\s]*臺[\s]*北[\s]*市',r'設[\s]*新[\s]*北[\s]*市',r'設[\s]*桃[\s]*園[\s]*市',r'設[\s]*臺[\s]*中[\s]*市',r'設[\s]*臺[\s]*南[\s]*市',r'設[\s]*高[\s]*雄[\s]*市',r'設[\s]*新[\s]*竹[\s]*縣',r'設[\s]*苗[\s]*栗[\s]*縣',r'設[\s]*彰[\s]*化[\s]*縣',r'設[\s]*南[\s]*投[\s]*縣',r'設[\s]*雲[\s]*林[\s]*縣',r'設[\s]*嘉[\s]*義[\s]*縣',r'設[\s]*屏[\s]*東[\s]*縣',r'設[\s]*宜[\s]*蘭[\s]*縣',r'設[\s]*花[\s]*蓮[\s]*縣',r'設[\s]*臺[\s]*東[\s]*縣',r'設[\s]*澎[\s]*湖[\s]*縣',r'設[\s]*金[\s]*門[\s]*縣',r'設[\s]*連[\s]*江[\s]*縣',r'設[\s]*基[\s]*隆[\s]*市',r'設[\s]*新[\s]*竹[\s]*市',r'設[\s]*嘉[\s]*義[\s]*市',
    r'籍[\s]*臺[\s]*北[\s]*市',r'籍[\s]*新[\s]*北[\s]*市',r'籍[\s]*桃[\s]*園[\s]*市',r'籍[\s]*臺[\s]*中[\s]*市',r'籍[\s]*臺[\s]*南[\s]*市',r'籍[\s]*高[\s]*雄[\s]*市',r'籍[\s]*新[\s]*竹[\s]*縣',r'籍[\s]*苗[\s]*栗[\s]*縣',r'籍[\s]*彰[\s]*化[\s]*縣',r'籍[\s]*南[\s]*投[\s]*縣',r'籍[\s]*雲[\s]*林[\s]*縣',r'籍[\s]*嘉[\s]*義[\s]*縣',r'籍[\s]*屏[\s]*東[\s]*縣',r'籍[\s]*宜[\s]*蘭[\s]*縣',r'籍[\s]*花[\s]*蓮[\s]*縣',r'籍[\s]*臺[\s]*東[\s]*縣',r'籍[\s]*澎[\s]*湖[\s]*縣',r'籍[\s]*金[\s]*門[\s]*縣',r'籍[\s]*連[\s]*江[\s]*縣',r'籍[\s]*基[\s]*隆[\s]*市',r'籍[\s]*新[\s]*竹[\s]*市',r'籍[\s]*嘉[\s]*義[\s]*市',
    r'設[\s]*籍[\s]*臺[\s]*北[\s]*市',r'設[\s]*籍[\s]*新[\s]*北[\s]*市',r'設[\s]*籍[\s]*桃[\s]*園[\s]*市',r'設[\s]*籍[\s]*臺[\s]*中[\s]*市',r'設[\s]*籍[\s]*臺[\s]*南[\s]*市',r'設[\s]*籍[\s]*高[\s]*雄[\s]*市',r'設[\s]*籍[\s]*新[\s]*竹[\s]*縣',r'設[\s]*籍[\s]*苗[\s]*栗[\s]*縣',r'設[\s]*籍[\s]*彰[\s]*化[\s]*縣',r'設[\s]*籍[\s]*南[\s]*投[\s]*縣',r'設[\s]*籍[\s]*雲[\s]*林[\s]*縣',r'設[\s]*籍[\s]*嘉[\s]*義[\s]*縣',r'設[\s]*籍[\s]*屏[\s]*東[\s]*縣',r'設[\s]*籍[\s]*宜[\s]*蘭[\s]*縣',r'設[\s]*籍[\s]*花[\s]*蓮[\s]*縣',r'設[\s]*籍[\s]*臺[\s]*東[\s]*縣',r'設[\s]*籍[\s]*澎[\s]*湖[\s]*縣',r'設[\s]*籍[\s]*金[\s]*門[\s]*縣',r'設[\s]*籍[\s]*連[\s]*江[\s]*縣',r'設[\s]*籍[\s]*基[\s]*隆[\s]*市',r'設[\s]*籍[\s]*新[\s]*竹[\s]*市',r'設[\s]*籍[\s]*嘉[\s]*義[\s]*市',
    r'臺[\s]*北[\s]*市',r'新[\s]*北[\s]*市',r'桃[\s]*園[\s]*市',r'臺[\s]*中[\s]*市',r'臺[\s]*南[\s]*市',r'高[\s]*雄[\s]*市',r'新[\s]*竹[\s]*縣',r'苗[\s]*栗[\s]*縣',r'彰[\s]*化[\s]*縣',r'南[\s]*投[\s]*縣',r'雲[\s]*林[\s]*縣',r'嘉[\s]*義[\s]*縣',r'屏[\s]*東[\s]*縣',r'宜[\s]*蘭[\s]*縣',r'花[\s]*蓮[\s]*縣',r'臺[\s]*東[\s]*縣',r'澎[\s]*湖[\s]*縣',r'金[\s]*門[\s]*縣',r'連[\s]*江[\s]*縣',r'基[\s]*隆[\s]*市',r'新[\s]*竹[\s]*市',r'嘉[\s]*義[\s]*市',
    
    r'法[\s]*定',r'股[\s]*份',r'金[\s]*額',r'金[\s]*鑫',r'信[\s]*箱',r'指[\s]*定',r'重[\s]*訴',r'兼[\s]*送',r'原[\s]*審',r'真[\s]*正',r'務[\s]*人',r'婚[\s]*姻',r'救[\s]*助',r'產[\s]*管',r'貨[\s]*款',
    r'提[\s]*存',r'提[\s]*起',r'減[\s]*少',r'匯[\s]*豐',r'會[\s]*議',r'瑕[\s]*疵',r'董[\s]*事',r'算[\s]*人',r'維[\s]*修',r'領[\s]*取',r'調[\s]*整',r'閱[\s]*覽',r'選[\s]*任',r'選[\s]*派',r'遺[\s]*贈',
    r'應[\s]*為',r'總[\s]*會',r'聲[\s]*請',r'職[\s]*務',r'職[\s]*權',r'離[\s]*婚',r'關[\s]*係',r'顧[\s]*問',r'滙[\s]*豐',r'人[\s]*之',r'人[\s]*為',r'十[\s]*三',r'下[\s]*同',r'上[\s]*一',r'上[\s]*三',
    r'上[\s]*五',r'上[\s]*六',r'上[\s]*字',r'上[\s]*訴',r'不[\s]*明',r'之[\s]*清',r'井[\s]*琪',r'公[\s]*示',r'再[\s]*字',r'同[\s]*上',r'合[\s]*作',r'因[\s]*被',r'地[\s]*址',r'死[\s]*亡',r'呈[\s]*報',
    r'受[\s]*人',r'定[\s]*代',r'房[\s]*地',r'承[\s]*人',
    ]
